PC1/PC1_operadores.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-01 qua 15:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Operadores e estrutura de decisão</title>
<meta name="author" content="Daniel R. Cassar" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Operadores e estrutura de decisão</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Índice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcd3751a">1. Operadores aritméticos</a></li>
<li><a href="#org13bd36c">2. Operadores lógicos</a></li>
<li><a href="#org6d76d80">3. Operadores de comparação</a></li>
<li><a href="#orge0f1e1a">4. <span class="todo TODO">TODO</span> Estrutura de decisão e operador condicional</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd3751a" class="outline-2">
<h2 id="orgcd3751a"><span class="section-number-2">1.</span> Operadores aritméticos</h2>
<div class="outline-text-2" id="text-1">
<p>
A linguagem Python contém diversos operadores aritméticos como adição (<code>+</code>), subtração (<code>-</code>), multiplicação (<code>*</code>), divisão (<code>/</code>), e exponencial (<code>**</code>). Estes operadores permitem realizar cálculos aritméticos com números inteiros, reais, e complexos. <span class="underline">Cuidado</span>: em Python, a exponenciação é representada por dois asteriscos; não confundir com o acento circunflexo (<code>^</code>) que é o operador de exponenciação usado no Excel!
</p>

<p>
<b>[A]</b> Reescreva o código abaixo em uma célula do Jupyter e veja o que acontece. Comente porque o resultado da terceira linha foi <code>100.25</code> e não <code>5.25</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">1</span> - <span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1</span> - <span style="color: #6c71c4; font-weight: bold;">1</span>)
<span style="color: #859900; font-weight: bold;">print</span>(-<span style="color: #6c71c4; font-weight: bold;">10</span> + <span style="color: #6c71c4; font-weight: bold;">10.5</span> * <span style="color: #6c71c4; font-weight: bold;">10.5</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">10</span> / <span style="color: #6c71c4; font-weight: bold;">2</span> * <span style="color: #6c71c4; font-weight: bold;">5</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">10</span> ** <span style="color: #6c71c4; font-weight: bold;">10</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">2</span> ** <span style="color: #6c71c4; font-weight: bold;">1</span> / <span style="color: #6c71c4; font-weight: bold;">2</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">2</span> ** (<span style="color: #6c71c4; font-weight: bold;">1</span> / <span style="color: #6c71c4; font-weight: bold;">2</span>))
<span style="color: #859900; font-weight: bold;">print</span>((<span style="color: #6c71c4; font-weight: bold;">1</span> + 1j) / (<span style="color: #6c71c4; font-weight: bold;">1</span> - 1j))
</pre>
</div>

<p>
A ordem de precedência dos operadores aritméticos (isto é, qual é a ordem de execução dos operadores) segue a regra do PEMDAS: parênteses, exponencial, multiplicação, divisão, adição, e subtração. Assim como na notação matemática, usamos parênteses para dar preferência para certas operações.
</p>

<p>
<b>[B]</b> Utilizando os operadores aritméticos do Python, compute:
</p>
<ol class="org-ol">
<li>Quantos segundos existem em 16 horas e 42 minutos?</li>
<li>Quantos centímetros existem em 72,8 milhas?</li>
<li>Se você percorrer 72,8 milhas em 16 horas e 42 minutos, qual a sua velocidade média em centímetros por segundo?</li>
<li>Quanto tempo você demoraria para percorrer a circunferência da Terra na linha do equador se permanecer na velocidade média obtida no item acima?</li>
</ol>

<p>
<b>[C]</b> Além dos operadores discutidos acima, existem diversos outros em Python. Dois operadores bastante úteis são a divisão inteira (<code>//</code>) e o módulo (<code>%</code>, também conhecido como resto da divisão inteira). Teste estes operadores e descreva como eles funcionam (em caso de dúvida, busque ajuda assim como discutido na Seção Buscando Ajuda). Discorra brevemente sobre possíveis situações onde estes operadores podem ser úteis.
</p>

<p>
<span class="underline">Atenção</span>: operadores aritméticos usualmente funcionam com qualquer combinação de números inteiros, reais, ou complexos. No entanto, preste atenção no tipo do resultado final!
</p>

<p>
<b>[D]</b> Escreva e execute o código abaixo e comente sobre o resultado obtido. Escreva um código similar ao código abaixo, porém alterando o operador de adição pelo operador de divisão. Você obteve algum resultado inusitado? Comente.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">inteiro_mais_inteiro</span> = <span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1</span>
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(inteiro_mais_inteiro))

<span style="color: #268bd2;">inteiro_mais_real</span> = <span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1.5</span>
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(inteiro_mais_real))

<span style="color: #268bd2;">real_mais_real</span> = <span style="color: #6c71c4; font-weight: bold;">1.5</span> + <span style="color: #6c71c4; font-weight: bold;">1.5</span>
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(real_mais_real))

<span style="color: #268bd2;">inteiro_mais_complexo</span> = <span style="color: #6c71c4; font-weight: bold;">10</span> + (<span style="color: #6c71c4; font-weight: bold;">1</span> - 2j)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(inteiro_mais_complexo))

<span style="color: #268bd2;">real_mais_complexo</span> = <span style="color: #6c71c4; font-weight: bold;">10.5</span> + (<span style="color: #6c71c4; font-weight: bold;">1</span> - 2j)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(real_mais_complexo))
</pre>
</div>

<p>
<b>Desafio</b>: durante um exercício de geometria, você decidiu realizar suas contas utilizando Python. Você escreveu o código abaixo em uma célula no seu caderno de notas Jupyter e o resultado que obteve foi inusitado! Por que o resultado é inusitado? Qual era o resultado esperado? Qual é a explicação para isso? Na sua opinião, este tipo de &ldquo;problema&rdquo; compromete o uso de Python como uma calculadora aritmética?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">pi</span> = <span style="color: #6c71c4; font-weight: bold;">3.14</span>
<span style="color: #268bd2;">valor</span> = pi + <span style="color: #6c71c4; font-weight: bold;">2</span>
<span style="color: #859900; font-weight: bold;">print</span>(valor)
</pre>
</div>
</div>
</div>
