PC1/PC1_operadores.html

<div id="outline-container-org13bd36c" class="outline-2">
<h2 id="org13bd36c"><span class="section-number-2">2.</span> Operadores lógicos</h2>
<div class="outline-text-2" id="text-2">
<p>
Variáveis lógicas (também conhecidas como variáveis booleanas) são objetos que podem assumir apenas dois valores diferentes: verdadeiro ou falso. Na sintaxe de Python, escrevemos verdadeiro ou falso em inglês e com a primeira letra maiúscula: <code>True</code> ou <code>False</code>.
</p>

<p>
Uma expressão booleana é uma expressão que, quando resolvida, resulta em um valor verdadeiro (<code>True</code>) ou em um valor falso (<code>False</code>). Expressões booleanas podem ser escritas com os operadores lógicos E (<code>and</code>), OU (<code>or</code>), e NÃO (<code>not</code>). Os operadores <code>and</code> e <code>or</code> são chamados de operadores binários pois requerem sempre dois argumentos para serem resolvidos. A sintaxe para usar estes operadores com os argumentos <code>A</code> e <code>B</code>, por exemplo, é a seguinte: <code>A and B</code> e <code>A or B</code>.
</p>

<p>
<b>[A]</b> Escreva e execute o código abaixo; comente sobre qual ou quais situações o operador <code>and</code> retorna o valor <code>True</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">True</span> <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4; font-weight: bold;">True</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">True</span> <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4; font-weight: bold;">False</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">False</span> <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4; font-weight: bold;">True</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">False</span> <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4; font-weight: bold;">False</span>)
</pre>
</div>

<p>
Se quisermos, podemos rescrever o código acima usando variáveis para facilitar a visualização:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">A</span> = <span style="color: #6c71c4; font-weight: bold;">True</span>
<span style="color: #268bd2;">B</span> = <span style="color: #6c71c4; font-weight: bold;">False</span>

<span style="color: #859900; font-weight: bold;">print</span>(A <span style="color: #859900; font-weight: bold;">and</span> A)
<span style="color: #859900; font-weight: bold;">print</span>(A <span style="color: #859900; font-weight: bold;">and</span> B)
<span style="color: #859900; font-weight: bold;">print</span>(B <span style="color: #859900; font-weight: bold;">and</span> A)
<span style="color: #859900; font-weight: bold;">print</span>(B <span style="color: #859900; font-weight: bold;">and</span> B)
</pre>
</div>

<p>
<b>[B]</b> Escreva e execute um código similar ao código acima, substituindo <code>and</code> por <code>or</code>; comente sobre qual ou quais situações o operador <code>or</code> retorna o valor <code>True</code>.
</p>

<p>
O operador <code>not</code> é um operador unário; ele requer apenas um argumento para ser computado. A sintaxe para usar este operador com o argumento <code>A</code>, por exemplo, é a seguinte: <code>not A</code>.
</p>

<p>
<b>[C]</b> Escreva e execute o código abaixo e comente sobre como o operador <code>not</code> funciona.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #859900; font-weight: bold;">not</span> <span style="color: #6c71c4; font-weight: bold;">True</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #859900; font-weight: bold;">not</span> <span style="color: #6c71c4; font-weight: bold;">False</span>)
</pre>
</div>

<p>
Operadores lógicos podem ser combinados na mesma declaração. Sempre que for fazer uma combinação de operadores lógicos, lembre-se de usar o parênteses para garantir a ordem de execução desejada.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">A</span> = <span style="color: #6c71c4; font-weight: bold;">True</span>
<span style="color: #268bd2;">B</span> = <span style="color: #6c71c4; font-weight: bold;">False</span>
<span style="color: #859900; font-weight: bold;">print</span>((A <span style="color: #859900; font-weight: bold;">or</span> B) <span style="color: #859900; font-weight: bold;">and</span> <span style="color: #859900; font-weight: bold;">not</span> (B <span style="color: #859900; font-weight: bold;">and</span> A))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d76d80" class="outline-2">
<h2 id="org6d76d80"><span class="section-number-2">3.</span> Operadores de comparação</h2>
<div class="outline-text-2" id="text-3">
<p>
Operadores de comparação (também conhecidos como operadores relacionais) fazem exatamente o que o nome sugere: comparam dois objetos. O resultado dessa comparação é uma variável booleana (<code>True</code> ou <code>False</code>).
</p>

<p>
Existem 6 operadores de comparação em Python:
</p>
<ul class="org-ul">
<li>igualdade (<code>==</code>)</li>
<li>diferença (<code>!=</code>)</li>
<li>maior que (<code>&gt;</code>)</li>
<li>menor que (<code>&lt;</code>)</li>
<li>maior ou igual que (<code>&gt;=</code>)</li>
<li>menor ou igual que (<code>&lt;=</code>)</li>
</ul>

<p>
<b>[A]</b> Suponha que <code>A = 1</code>, <code>B = 2</code>, <code>C = 4</code>, <code>D = 8</code>, e <code>E = 16</code>. Atribua o valor verdadeiro ou falso para cada uma das expressões abaixo. Escreva um código em Python para checar se você acertou. Comente sobre como funcionam as expressões com mais de um operador de comparação.
</p>

<div class="org-src-container">
<pre class="src src-python">A == B
A &lt; B
B &gt; C
D &lt;= E
A != E
E &gt;= D &gt;= C
A &lt; C == D
A + A != B
A + A &lt; B &lt; C - B
A + A &lt;= B &lt;= C - B
A != B &lt; C == E - D - C
</pre>
</div>

<p>
<span class="underline">Cuidado</span>: é muito comum confundir o operador de atribuição (<code>=</code>) com o operador de comparação de igualdade (<code>==</code>). O operador de atribuição é usado para atribuir um valor a uma variável, por exemplo: <code>A = 10</code> atribui o valor 10 para a variável <code>A</code>. Já o operador de comparação de igualdade responde a pergunta se os objetos sendo comparados são iguais. Neste caso, a expressão <code>A == 10</code> responde a pergunta se o valor armazenado em <code>A</code> é igual a 10, resposta esta que pode ser verdadeiro ou falso.
</p>
</div>
</div>
